---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.CurveIsSlopeDefining
source: html/118eb7d4-68e4-e7b0-166a-8a527674b6e1.htm
---
# Autodesk.Revit.DB.ParameterTypeId.CurveIsSlopeDefining Property

"Defines Slope"

## Syntax (C#)
```csharp
public static ForgeTypeId CurveIsSlopeDefining { get; }
```